app/controllers/busgroups_controller.rb

SELECT id as group_id, busgroupcode as code, description, isactive as status, createddate, createdby, lastupdatedate, lastupdateby FROM "BUSGROUPS" WHERE "BUSGROUPS"."MYPCLIENT_ID" = 'SAMSU'
---
  def setupList
    begin
      @busgroups =  Busgroup.select('id as group_id, busgroupcode as code, description, isactive as status, createddate, createdby, lastupdatedate, lastupdateby')
                    .where(:mypclient_id => @@client_id)