app/controllers/client_controller.rb

    def default_selections
        begin
            @positions = Position.select('positions.id, positions.positioncode as code, positions.description as desc, positions.company_id, positions.positionlevel_id, positionlevels.description as position_level')
                                .joins(:Positionlevel)
                                .where({:isactive=>1, :mypclient_id => @@client_id})
            @clean_positions  = @@stripper.activeRecordData(@positions)
            @@request_result[:positions] = {}
            @@request_result[:positions][:data] = @clean_positions
            @@request_result[:positions][:metaData] = @@meta_data.create(@positions)

            @companies = Company.select('id, companycode as code, description as desc, busgroup_id, holdcompany_id')
                        .where({:isactive=>1, :mypclient_id => @@client_id})
            @clean_companies = @@stripper.activeRecordData(@companies)
            @@request_result[:companies] = {}
            @@request_result[:companies][:data] = @clean_companies
            @@request_result[:companies][:metaData] = @@meta_data.create(@companies)

            @departments = Department.select('id, departmentcode as code, description as desc, company_id')
                              .where({:isactive=>1, :mypclient_id => @@client_id})
            @clean_departments = @@stripper.activeRecordData(@departments)
            @@request_result[:departments] = {}
            @@request_result[:departments][:data] = @clean_departments
            @@request_result[:departments][:metaData] = @@meta_data.create(@departments)

            @dept_groups = Deptgroup.select('id, deptgroupcode as code, description as desc, department_id, company_id')
                              .where({:isactive=>1, :mypclient_id => @@client_id})
---
SELECT COUNT(*) FROM "POSITIONS" INNER JOIN "POSITIONLEVELS" ON "POSITIONLEVELS"."ID" = "POSITIONS"."POSITIONLEVEL_ID" WHERE "POSITIONS"."ISACTIVE" = 1 AND "POSITIONS"."MYPCLIENT_ID" = 'MERCU'
SELECT positions.id, positions.positioncode as code, positions.description as desc, positions.company_id, positions.positionlevel_id, positionlevels.description as position_level FROM "POSITIONS" INNER JOIN "POSITIONLEVELS" ON "POSITIONLEVELS"."ID" = "POSITIONS"."POSITIONLEVEL_ID" WHERE "POSITIONS"."ISACTIVE" = 1 AND "POSITIONS"."MYPCLIENT_ID" = 'MERCU'
SELECT COUNT(*) FROM "COMPANIES" WHERE "COMPANIES"."ISACTIVE" = 1 AND "COMPANIES"."MYPCLIENT_ID" = 'MERCU'
SELECT COUNT(*) FROM "POSITIONLEVELS" WHERE "POSITIONLEVELS"."MYPCLIENT_ID" = 'MERCU'
SELECT id, companycode as code, description as desc, busgroup_id, holdcompany_id FROM "COMPANIES" WHERE "COMPANIES"."ISACTIVE" = 1 AND "COMPANIES"."MYPCLIENT_ID" = 'MERCU'
SELECT COUNT(*) FROM "DEPARTMENTS" WHERE "DEPARTMENTS"."ISACTIVE" = 1 AND "DEPARTMENTS"."MYPCLIENT_ID" = 'MERCU'
SELECT id, departmentcode as code, description as desc, company_id FROM "DEPARTMENTS" WHERE "DEPARTMENTS"."ISACTIVE" = 1 AND "DEPARTMENTS"."MYPCLIENT_ID" = 'MERCU'
SELECT COUNT(*) FROM "DEPTGROUPS" WHERE "DEPTGROUPS"."ISACTIVE" = 1 AND "DEPTGROUPS"."MYPCLIENT_ID" = 'MERCU'
SELECT id, deptgroupcode as code, description as desc, department_id, company_id FROM "DEPTGROUPS" WHERE "DEPTGROUPS"."ISACTIVE" = 1 AND "DEPTGROUPS"."MYPCLIENT_ID" = 'MERCU'

            @@request_result[:dept_groups][:data] = @clean_dept_groups
            @@request_result[:dept_groups][:metaData] = @@meta_data.create(@dept_groups)

            @busgroups = Busgroup.select('id, busgroupcode as code, description as desc').where({:isactive=>1, :mypclient_id => @@client_id})
---
SELECT id, busgroupcode as code, description as desc FROM "BUSGROUPS" WHERE "BUSGROUPS"."ISACTIVE" = 1 AND "BUSGROUPS"."MYPCLIENT_ID" = 'MERCU'

            @@request_result[:busgroups][:data] = @clean_busgroups
            @@request_result[:busgroups][:metaData] = @@meta_data.create(@busgroups)

            @holdings = Holdcompany.select('id, holdcompanycode as code, description as desc').where({:isactive=>1, :mypclient_id => @@client_id})
---
SELECT COUNT(*) FROM "HOLDCOMPANIES" WHERE "HOLDCOMPANIES"."ISACTIVE" = 1 AND "HOLDCOMPANIES"."MYPCLIENT_ID" = 'MERCU'
SELECT id, holdcompanycode as code, description as desc FROM "HOLDCOMPANIES" WHERE "HOLDCOMPANIES"."ISACTIVE" = 1 AND "HOLDCOMPANIES"."MYPCLIENT_ID" = 'MERCU'

            @@request_result[:holdings] = {data: @clean_holdings, metaData:@@meta_data.create(@holdings)}


            @emp_titles =  Emptitle.select('id as code, description as desc').order('seqno')
---
SELECT id as code, description as desc FROM "EMPTITLES" ORDER BY seqno

            @@request_result[:titles][:data] = @clean_titles
            @@request_result[:titles][:metaData] = @@meta_data.create(@emp_titles)

            @locations = Location.select('locations.id, locations.locationcode as code, locations.description as desc, locations.company_id, companies.description as company')
                        .joins(:Company)
                        .where({:isactive=>1, :mypclient_id=>@@client_id})
---
SELECT COUNT(*) FROM "LOCATIONS" INNER JOIN "COMPANIES" ON "COMPANIES"."ID" = "LOCATIONS"."COMPANY_ID" WHERE "LOCATIONS"."ISACTIVE" = 1 AND "LOCATIONS"."MYPCLIENT_ID" = 'MERCU'
SELECT locations.id, locations.locationcode as code, locations.description as desc, locations.company_id, companies.description as company FROM "LOCATIONS" INNER JOIN "COMPANIES" ON "COMPANIES"."ID" = "LOCATIONS"."COMPANY_ID" WHERE "LOCATIONS"."ISACTIVE" = 1 AND "LOCATIONS"."MYPCLIENT_ID" = 'MERCU'

    def holidays
        begin
            holidays = Holiday.joins(:Holidaytype, :Country)
                    .select('holidays.*, holidaytypes.description as holiday_type, countries.description as country')
                    .where({:mypclient_id => @@client_id}).order(:country_id)
                    .order('holidaydate')
---
SELECT COUNT(*) FROM "HOLIDAYS" INNER JOIN "HOLIDAYTYPES" ON "HOLIDAYTYPES"."ID" = "HOLIDAYS"."HOLIDAYTYPE_ID" INNER JOIN "COUNTRIES" ON "COUNTRIES"."ID" = "HOLIDAYS"."COUNTRY_ID" WHERE "HOLIDAYS"."MYPCLIENT_ID" = 'MERCU'
SELECT holidays.*, holidaytypes.description as holiday_type, countries.description as country FROM "HOLIDAYS" INNER JOIN "HOLIDAYTYPES" ON "HOLIDAYTYPES"."ID" = "HOLIDAYS"."HOLIDAYTYPE_ID" INNER JOIN "COUNTRIES" ON "COUNTRIES"."ID" = "HOLIDAYS"."COUNTRY_ID" WHERE "HOLIDAYS"."MYPCLIENT_ID" = 'MERCU' ORDER BY country_id, holidaydate

    def locations
        begin
            locations = Location.joins(:Company).select('locations.*, companies.description as company').where({:mypclient_id=>@@client_id})
---
SELECT COUNT(*) FROM "LOCATIONS" INNER JOIN "COMPANIES" ON "COMPANIES"."ID" = "LOCATIONS"."COMPANY_ID" WHERE "LOCATIONS"."MYPCLIENT_ID" = 'SAMSU'
SELECT locations.*, companies.description as company FROM "LOCATIONS" INNER JOIN "COMPANIES" ON "COMPANIES"."ID" = "LOCATIONS"."COMPANY_ID" WHERE "LOCATIONS"."MYPCLIENT_ID" = 'SAMSU'