app/controllers/companies_controller.rb

  def setupList()
    begin
      @companies = Company.joins('LEFT JOIN Countries on countries.id = companies.country_id')
                    .joins('LEFT JOIN Holdcompanies on holdcompanies.id = companies.holdcompany_id')
                    .select('companies.*, countries.description as country, holdcompanies.description as holding_company')
                    .where(:mypclient_id => @@client_id)
---
SELECT COUNT(*) FROM "COMPANIES" LEFT JOIN Countries on countries.id = companies.country_id LEFT JOIN Holdcompanies on holdcompanies.id = companies.holdcompany_id WHERE "COMPANIES"."MYPCLIENT_ID" = 'SAMSU'
SELECT companies.*, countries.description as country, holdcompanies.description as holding_company FROM "COMPANIES" LEFT JOIN Countries on countries.id = companies.country_id LEFT JOIN Holdcompanies on holdcompanies.id = companies.holdcompany_id WHERE "COMPANIES"."MYPCLIENT_ID" = 'SAMSU'