app/controllers/cut_offs_controller.rb

SELECT COUNT(*) FROM "CUTOFFS" WHERE "CUTOFFS"."MYPCLIENT_ID" = 'SAMSU' AND "CUTOFFS"."COMPANY_ID" = 38
---
  def index
    begin
      company_id = params[:company_id]
      @cut_offs = Cutoff.where({:mypclient_id => @@client_id, :company_id => company_id})