app/controllers/departments_controller.rb

  def setupList()

    begin
      @departments =  Department.select('departments.id as department_id, departments.company_id, companies.description as company, departments.departmentcode,
                        departments.description, departments.isactive as status, departments.createddate, departments.createdby,
                        departments.lastupdatedate, departments.lastupdateby')
                      .joins('INNER JOIN companies ON companies.id = departments.company_id')
                      .where(:mypclient_id => @@client_id)
---
SELECT COUNT(*) FROM "DEPARTMENTS" INNER JOIN companies ON companies.id = departments.company_id WHERE "DEPARTMENTS"."MYPCLIENT_ID" = 'MERCU'