app/controllers/dtr_controller.rb

SELECT COUNT(*) FROM "TIMELOGS" WHERE (empbadgeno = '1181' AND mypclient_id = 'SAMSU' AND logdate between '2014-03-20' AND '2014-03-20')
---
  def logs
    begin
      badge_no = params[:badge_no]
      date_start = params[:date_start].nil? || params[:date_start].blank? ? Time.now : Date.strptime(params[:date_start], "%m/%d/%Y")
      date_end = params[:date_end].nil? || params[:date_end].blank? ? Time.now : Date.strptime(params[:date_end], "%m/%d/%Y")
      @logs = Timelog.employee_logs_by_badgeno_and_client_id(badge_no, @@client_id, date_start, date_end)

      @cl_logs = @@stripper.activeRecordData(@logs)
      @meta = @@meta_data.create(@logs)
      @total_logs = @logs.count

SELECT "EMPDTRS".* FROM "EMPDTRS" WHERE (mypclient_id = 'MERCU' AND empidno = 'GT-1900') ROWS 1 TO 3
---
  def history
    begin
      @dtr_logs = Empdtr.where(history_condition).limit(3).offset(0)