app/controllers/employees_controller.rb

SELECT "EMPLOYEES".* FROM "EMPLOYEES" WHERE "EMPLOYEES"."MYPCLIENT_ID" = 'SAMSU' ORDER BY "EMPLOYEES"."ID" DESC ROWS 1
---
    def newEmployeeNumber
        begin
            @last_employee    = Employee.where({:mypclient_id => @@client_id}).last

SELECT COUNT(*) FROM "EMPLOYEES" INNER JOIN "COMPANIES" ON "COMPANIES"."ID" = "EMPLOYEES"."COMPANY_ID" INNER JOIN "BUSGROUPS" ON "BUSGROUPS"."ID" = "EMPLOYEES"."BUSGROUP_ID" INNER JOIN "POSITIONS" ON "POSITIONS"."ID" = "EMPLOYEES"."POSITION_ID" INNER JOIN "POSITIONLEVELS" ON "POSITIONLEVELS"."ID" = "EMPLOYEES"."POSITIONLEVEL_ID" INNER JOIN "HOLDCOMPANIES" ON "HOLDCOMPANIES"."ID" = "EMPLOYEES"."HOLDCOMPANY_ID" INNER JOIN "DEPARTMENTS" ON "DEPARTMENTS"."ID" = "EMPLOYEES"."DEPARTMENT_ID" INNER JOIN "LOCATIONS" ON "LOCATIONS"."ID" = "EMPLOYEES"."LOCATION_ID" WHERE (UPPER(employees.empnamelast) LIKE '%QUEVAS%' AND employees.empidno = '0014' AND employees.mypclient_id = 'SAMSU')
---
    def list
        begin
            company_id = params[:company_id]
            conditions = params[:selector].nil? ? search_condition : selector_filters

            @employees =  Employee.select("employees.*, companies.description as company_desc, busgroups.description as busgroup_desc,
                    positions.description as position_desc, positionlevels.description as positionlevel_desc,
                    holdcompanies.description as holdcompany_desc, departments.description as department_desc, locations.locationcode")
                .joins(:Company, :Busgroup, :Position, :Positionlevel, :Holdcompany, :Department, :Location)
                .where(conditions)
                .order('companies.description, employees.empfullnamelfm')

INSERT INTO "EMPLOYEES" ("BUSGROUP_ID", "COMPANY_ID", "CREATEDBY", "CREATEDDATE", "DATEHIRED", "DEPARTMENT_ID", "DEPTGROUP_ID", "EMAILADDRESS", "EMPBADGENO", "EMPIDNO", "EMPNAMEALIAS", "EMPNAMEFIRST", "EMPNAMELAST", "EMPNAMEMIDDLE", "EMPNAMESUFFIX", "EMPNO", "EMPTITLE_ID", "HOLDCOMPANY_ID", "ID", "ISACTIVESTATUS", "LASTUPDATEBY", "LASTUPDATEDATE", "LOCATION_ID", "MYPCLIENT_ID", "POSITION_ID", "POSITIONLEVEL_ID") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    begin

      @new_employee = @@data_util.hash_data_to_upper_case(@@data_util.strip_hash_data(params[:employee]), [])
      @new_employee[:mypclient_id] = @@client_id
      @new_employee[:datehired] = Date.strptime(@new_employee[:datehired], "%m/%d/%Y")
      @new_employee[:emailaddress] = @new_employee[:emailaddress].downcase
      @new_employee[:isactivestatus] = 1
      @employee = Employee.new(@new_employee)
      if @employee.save

SELECT "EMPLOYEES".* FROM "EMPLOYEES" WHERE "EMPLOYEES"."ID" = ? ROWS 1  [["id", "74"]]
DELETE FROM "EMPLOYEES" WHERE "EMPLOYEES"."ID" = ?  [["id", 74]]
---
  def destroy
    begin
      @employee = Employee.find(params[:id])
      if @employee.destroy

SELECT "EMPLOYEES".* FROM "EMPLOYEES" WHERE (mypclient_id = ? and empidno not in ('56567','345','567','345345','GA-02193','4567','PMD-001','23244','081','GT-1900','1254','454','1111')), MERCU
SELECT "COMPANIES".* FROM "COMPANIES" WHERE "COMPANIES"."ID" = 6 ROWS 1
---
  def without_policy
    begin
      @employees = Employee.where("mypclient_id = ? and empidno not in (?)", @@client_id, with_policy)
      @employees.each {|emp| emp[:company] = emp.Company.description}

SELECT "EMPLOYEES".* FROM "EMPLOYEES" WHERE (mypclient_id = ? and empidno not in ('GT-1900','GA-02193','4567','SDFSDF','PMD-001','567','23244','1254','454','1111')), MERCU
SELECT "COMPANIES".* FROM "COMPANIES" WHERE "COMPANIES"."ID" = 38 ROWS 1
---
  def without_schedule
    begin
      @employees = Employee.where("mypclient_id = ? and empidno not in (?)", @@client_id, with_schedule)
      @employees.each {|emp| emp[:company] = emp.Company.description}