app/controllers/employee_schedule_controller.rb

  def assigned_employees
    begin
      @schedule_id = params[:schedule_id]
      conditions = []
      conditions[0] = ["employees.location_id = #{params[:location_id]}"] unless params[:location_id].blank?
      conditions[1] = ["employees.isactivestatus = #{params[:status]}"] unless params[:status].blank?
      conditions[2] = ["empskeds.worksked_id = #{@schedule_id}"] unless @schedule_id.blank?
      conditions[3] = ["empskeds.mypclient_id = '#{@@client_id}'"]
      clean_conditions = conditions.compact.flatten

      @assigned = Empsked.select('empskeds.*, empskeds.id as empsked_id, employees.*')
                            .where(clean_conditions.join(' AND '))
                            .joins('INNER JOIN employees on employees.empidno = empskeds.empidno and employees.mypclient_id = empskeds.mypclient_id')
---
SELECT empskeds.*, empskeds.id as empsked_id, employees.* FROM "EMPSKEDS" INNER JOIN employees on employees.empidno = empskeds.empidno and employees.mypclient_id = empskeds.mypclient_id WHERE (employees.isactivestatus = 1 AND empskeds.worksked_id = 7 AND empskeds.mypclient_id = 'MERCU')

  def update_assignment
    begin
      emp_schedules = JSON.parse params[:emp_schedule]
      Empsked.transaction do
        emp_schedules.each {|emp_sched|
          @assigned = Empsked.where({:mypclient_id=>emp_sched['mypclient_id'],:company_id=>emp_sched['company_id'], :empidno=>emp_sched['empidno']})

          # if emp_sched['action'] == 'destroy'
          #   @assigned.destroy_all
          if @assigned.empty?
            @assign = Empsked.new(emp_sched)
            @assign.save
          else
            @assigned[0].update_attributes({:worksked_id => emp_sched['worksked_id']})
---
SELECT "EMPSKEDS".* FROM "EMPSKEDS" WHERE "EMPSKEDS"."MYPCLIENT_ID" = 'MERCU' AND "EMPSKEDS"."COMPANY_ID" = 6 AND "EMPSKEDS"."EMPIDNO" = 'SDFSDF'
SELECT COUNT(*) FROM "EMPSKEDS" WHERE "EMPSKEDS"."MYPCLIENT_ID" = 'MERCU' AND "EMPSKEDS"."COMPANY_ID" = 6 AND "EMPSKEDS"."EMPIDNO" = 'SDFSDF'
UPDATE "EMPSKEDS" SET "WORKSKED_ID" = 18 WHERE "EMPSKEDS"."ID" = 16