app/controllers/emppolicies_controller.rb

SELECT emppolicies.*, emppolicies.id as emppolicy_id, employees.* FROM "EMPPOLICIES" INNER JOIN employees on employees.empidno = emppolicies.empidno and employees.mypclient_id = emppolicies.mypclient_id WHERE (employees.isactivestatus = 1 AND emppolicies.workskedpolicy_id = 7 AND emppolicies.mypclient_id = 'MERCU')
---
  def assigned_employees
    begin
      @policy_id = params[:policy_id]
      conditions = []
      conditions[0] = ["employees.location_id = #{params[:location_id]}"] unless params[:location_id].blank?
      conditions[1] = ["employees.isactivestatus = #{params[:status]}"] unless params[:status].blank?
      conditions[2] = ["emppolicies.workskedpolicy_id = #{@policy_id}"] unless @policy_id.blank?
      conditions[3] = ["emppolicies.mypclient_id = '#{@@client_id}'"]
      clean_conditions = conditions.compact.flatten

      @assigned = Emppolicy.select('emppolicies.*, emppolicies.id as emppolicy_id, employees.*')
                            .where(clean_conditions.join(' AND '))
                            .joins('INNER JOIN employees on employees.empidno = emppolicies.empidno and employees.mypclient_id = emppolicies.mypclient_id')

SELECT COUNT(*) FROM "EMPPOLICIES" WHERE "EMPPOLICIES"."MYPCLIENT_ID" = 'MERCU' AND "EMPPOLICIES"."COMPANY_ID" = 6 AND "EMPPOLICIES"."EMPIDNO" = 'SDFSDF'
INSERT INTO "EMPPOLICIES" ("COMPANY_ID", "CREATEDBY", "CREATEDDATE", "EMPIDNO", "ENDDATE", "ID", "LASTUPDATEBY", "LASTUPDATEDATE", "MYPCLIENT_ID", "STARTDATE", "WORKSKEDPOLICY_ID") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def update_assignment
    begin
      emp_policies = JSON.parse params[:emp_policy]
      Emppolicy.transaction do
        emp_policies.each {|emp_policy|
          @assigned = Emppolicy.where({:mypclient_id=>emp_policy['mypclient_id'],:company_id=>emp_policy['company_id'], :empidno=>emp_policy['empidno']})

          if emp_policy['action'] == 'destroy'
            @assigned.destroy_all
          elsif @assigned.empty?
            emp_policy.delete('action')
            @assign = Emppolicy.new(emp_policy)
            @assign.save