app/controllers/holdcompanies_controller.rb

  def setupList
    begin
      @holding_coms = Holdcompany.select('id as holding_id, holdcompanycode as code, description, isactive as status, createddate, createdby, lastupdatedate, lastupdateby')
                      .where(:mypclient_id => @@client_id)
---
SELECT id as holding_id, holdcompanycode as code, description, isactive as status, createddate, createdby, lastupdatedate, lastupdateby FROM "HOLDCOMPANIES" WHERE "HOLDCOMPANIES"."MYPCLIENT_ID" = 'SAMSU'