app/controllers/regular_user_pages_controller.rb

  def profile
    begin
      @my_profile = Employee.find(session[:employee_id])
---
SELECT "EMPLOYEES".* FROM "EMPLOYEES" WHERE "EMPLOYEES"."ID" = ? ROWS 1  [["id", 1]]