app/controllers/workskedpatterns_controller.rb

  def setupList
    begin
      @workskeds = Workskedpattern.joins(:Workskedcategory, :Company)
                  .select('workskedpatterns.*, workskedcategories.description as category, companies.description as company')
                  .where(:mypclient_id => @@client_id)
---
SELECT COUNT(*) FROM "WORKSKEDPATTERNS" INNER JOIN "WORKSKEDCATEGORIES" ON "WORKSKEDCATEGORIES"."ID" = "WORKSKEDPATTERNS"."WORKSKEDCATEGORY_ID" INNER JOIN "COMPANIES" ON "COMPANIES"."ID" = "WORKSKEDPATTERNS"."COMPANY_ID" WHERE "WORKSKEDPATTERNS"."MYPCLIENT_ID" = 'SAMSU'
SELECT workskedpatterns.*, workskedcategories.description as category, companies.description as company FROM "WORKSKEDPATTERNS" INNER JOIN "WORKSKEDCATEGORIES" ON "WORKSKEDCATEGORIES"."ID" = "WORKSKEDPATTERNS"."WORKSKEDCATEGORY_ID" INNER JOIN "COMPANIES" ON "COMPANIES"."ID" = "WORKSKEDPATTERNS"."COMPANY_ID" WHERE "WORKSKEDPATTERNS"."MYPCLIENT_ID" = 'SAMSU'