app/controllers/work_plan_managers_controller.rb

SELECT COUNT(*) FROM "EMPLOYEES" LEFT JOIN empskeds on empskeds.empidno = employees.empidno and empskeds.company_id = employees.company_id and empskeds.mypclient_id = employees.mypclient_id LEFT JOIN workskeds on workskeds.id = empskeds.worksked_id LEFT JOIN emppolicies on emppolicies.empidno = employees.empidno and emppolicies.company_id = employees.company_id and emppolicies.mypclient_id = employees.mypclient_id LEFT JOIN workskedpolicies on workskedpolicies.id = emppolicies.workskedpolicy_id WHERE (employees.company_id = 38 AND employees.mypclient_id = 'SAMSU' AND employees.isactivestatus = 1)
SELECT employees.*, empskeds.worksked_id, workskeds.*, workskeds.description as sked_description, workskeds.workskedcode, emppolicies.workskedpolicy_id, workskedpolicies.description as policy_description, workskedpolicies.policycode FROM "EMPLOYEES" LEFT JOIN empskeds on empskeds.empidno = employees.empidno and empskeds.company_id = employees.company_id and empskeds.mypclient_id = employees.mypclient_id LEFT JOIN workskeds on workskeds.id = empskeds.worksked_id LEFT JOIN emppolicies on emppolicies.empidno = employees.empidno and emppolicies.company_id = employees.company_id and emppolicies.mypclient_id = employees.mypclient_id LEFT JOIN workskedpolicies on workskedpolicies.id = emppolicies.workskedpolicy_id WHERE (employees.company_id = 38 AND employees.mypclient_id = 'SAMSU' AND employees.isactivestatus = 1)
---
	def employees
		begin
			@employee_controller = EmployeesController.new
			@employees = Employee.select('employees.*, empskeds.worksked_id, workskeds.*, workskeds.description as sked_description, workskeds.workskedcode, '+
						'emppolicies.workskedpolicy_id, workskedpolicies.description as policy_description, workskedpolicies.policycode, '+
						'locations.description as location'
					)
					.joins('LEFT JOIN empskeds on empskeds.empidno = employees.empidno '+
						 'and empskeds.company_id = employees.company_id and empskeds.mypclient_id = employees.mypclient_id')
					.joins('LEFT JOIN workskeds on workskeds.id = empskeds.worksked_id')
					.joins('LEFT JOIN emppolicies on emppolicies.empidno = employees.empidno '+
						 'and emppolicies.company_id = employees.company_id and emppolicies.mypclient_id = employees.mypclient_id')
					.joins('LEFT JOIN workskedpolicies on workskedpolicies.id = emppolicies.workskedpolicy_id')
					.joins('INNER JOIN locations on locations.id = employees.location_id')
					.where(search_condition)

SELECT "EMPWORKPLANS".* FROM "EMPWORKPLANS" WHERE "EMPWORKPLANS"."MYPCLIENT_ID" = 'SAMSU' AND "EMPWORKPLANS"."COMPANY_ID" = 38 AND "EMPWORKPLANS"."EMPIDNO" = '0007' AND ("EMPWORKPLANS"."SKEDDATEIN" BETWEEN '01/03/2014' AND '03/20/2014')
---
	def employee_work_plan
		begin
			company_id = params[:company_id]
			id_number = params[:id_number]
			start_date = params[:start_date]
			end_date = params[:end_date]

			Empworkplan.transaction do
				if Empworkplan.fill_up(@@client_id, id_number, start_date, end_date, 0, 1)
					@work_plans = Empworkplan.where({:mypclient_id=>@@client_id, :company_id=>company_id, :empidno => id_number, :skeddatein => start_date..end_date});