app/controllers/workskeds_controller.rb

  def setupList
    begin
      @workskeds = Worksked.joins(:Workskedcategory, :Company)
                  .select('workskeds.*, workskedcategories.description as category, companies.description as company')
                  .where(:mypclient_id => @@client_id)
---
SELECT COUNT(*) FROM "WORKSKEDS" INNER JOIN "WORKSKEDCATEGORIES" ON "WORKSKEDCATEGORIES"."ID" = "WORKSKEDS"."WORKSKEDCATEGORY_ID" INNER JOIN "COMPANIES" ON "COMPANIES"."ID" = "WORKSKEDS"."COMPANY_ID" WHERE "WORKSKEDS"."MYPCLIENT_ID" = 'MERCU'
SELECT workskeds.*, workskedcategories.description as category, companies.description as company FROM "WORKSKEDS" INNER JOIN "WORKSKEDCATEGORIES" ON "WORKSKEDCATEGORIES"."ID" = "WORKSKEDS"."WORKSKEDCATEGORY_ID" INNER JOIN "COMPANIES" ON "COMPANIES"."ID" = "WORKSKEDS"."COMPANY_ID" WHERE "WORKSKEDS"."MYPCLIENT_ID" = 'MERCU'