app/controllers/workskedpolicies_controller.rb

SELECT COUNT(*) FROM "WORKSKEDPOLICIES" INNER JOIN "COMPANIES" ON "COMPANIES"."ID" = "WORKSKEDPOLICIES"."COMPANY_ID" INNER JOIN "MYPCLIENTS" ON "MYPCLIENTS"."ID" = "WORKSKEDPOLICIES"."MYPCLIENT_ID" WHERE "WORKSKEDPOLICIES"."MYPCLIENT_ID" = 'MERCU'
SELECT workskedpolicies.*, companies.description as company, mypclients.description as client FROM "WORKSKEDPOLICIES" INNER JOIN "COMPANIES" ON "COMPANIES"."ID" = "WORKSKEDPOLICIES"."COMPANY_ID" INNER JOIN "MYPCLIENTS" ON "MYPCLIENTS"."ID" = "WORKSKEDPOLICIES"."MYPCLIENT_ID" WHERE "WORKSKEDPOLICIES"."MYPCLIENT_ID" = 'MERCU'
---
  def client_list
    begin
      @policies = Workskedpolicy.joins(:Company, :Mypclient)
                  .select('workskedpolicies.*, companies.description as company, mypclients.description as client')
                  .where(:mypclient_id => @@client_id)